lains/stm32-linky-display/src/main.cpp
/* Includes ------------------------------------------------------------------*/
#include "Stm32SerialDriver.h"
#include "Stm32LcdDriver.h"
#include "Stm32TimerDriver.h"
#include "Stm32DebugOutput.h"
#include "Stm32MonotonicTimeDriver.h"
#include "TIC/Unframer.h"
#include "TicProcessingContext.h"
#include "PowerHistory.h"
#include "TicFrameParser.h"
#include "HistoryDraw.h"

//#define SIMULATE_POWER_VALUES_WITHOUT_TIC

extern "C" {
#include "main.h"
#include <stdio.h>
#include <string.h> // For strlen()
#include "font58.h"

static void SystemClock_Config(void); /* Defined below */
}

#ifdef USE_STM32F769I_DISCO
static void MPU_Config(void);
static void CPU_CACHE_Enable(void);
#endif

/* Private define ------------------------------------------------------------*/
const unsigned int LCDWidth = 800;
const unsigned int LCDHeight = 480;
const unsigned int BytesPerPixel = 4; /* For ARGB8888 mode */

#define VSYNC               1 
#define VBP                 1 
#define VFP                 1
#define VACT                LCDHeight
#define HSYNC               1
#define HBP                 1
#define HFP                 1
#define HACT                LCDWidth

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

//static uint32_t ImageIndex = 0;
/*static const uint32_t * Images[] = 
{
    image_320x240_argb8888,
    life_augmented_argb8888,
};*/

/**
  * @brief  On Error Handler on condition TRUE.
  * @param  condition : Can be TRUE or FALSE
  * @retval None
  */
void OnError_Handler(uint32_t condition)
{
    if(condition) {
#ifdef LED_ERROR
        BSP_LED_On(LED_ERROR);
#endif
        while(1) { ; } /* Blocking on error */
    }
}

void Error_Handler() {
	  OnError_Handler(1);
}

/**
 * @brief Genenate a status string
 * 
 * @param lcdRefreshCount The number of LCD refreshes
 * @param framesCount The number of TIC frames received
 * @param rxBytesCount The number of TIC serial bytes received
 * @param errors The number of decoding errors
 * @param[in] displayedHorodate The current horodate (if known), or nullptr to exclude the horodate from the returned string
 * 
 * @note The returned status string is a static buffer owned by this function.
 *       It is thus always properly allocated and has valid content until the next call of this function.
 */
const char* getStatusString(unsigned int lcdRefreshCount, unsigned int framesCount, unsigned long rxBytesCount, unsigned int errors, const TimeOfDay* displayedHorodate) {
    static char statusLine[]="@@@@@L @@@@@F @@@@@@@@B @@X H@@:@@:@@";
    uint8_t pos = 0;
    statusLine[pos++]=(lcdRefreshCount / 10000) % 10 + '0';
    statusLine[pos++]=(lcdRefreshCount / 1000) % 10 + '0';
    statusLine[pos++]=(lcdRefreshCount / 100) % 10 + '0';
    statusLine[pos++]=(lcdRefreshCount / 10) % 10 + '0';
    statusLine[pos++]=(lcdRefreshCount / 1) % 10 + '0';
    pos++; // 'L'

    pos++;

    statusLine[pos++]=(framesCount / 10000) % 10 + '0';
    statusLine[pos++]=(framesCount / 1000) % 10 + '0';
    statusLine[pos++]=(framesCount / 100) % 10 + '0';
    statusLine[pos++]=(framesCount / 10) % 10 + '0';
    statusLine[pos++]=(framesCount / 1) % 10 + '0';
    pos++; // 'F'

    pos++;

    statusLine[pos++]=(rxBytesCount / 10000000) % 10 + '0';
    statusLine[pos++]=(rxBytesCount / 1000000) % 10 + '0';
    statusLine[pos++]=(rxBytesCount / 100000) % 10 + '0';
    statusLine[pos++]=(rxBytesCount / 10000) % 10 + '0';
    statusLine[pos++]=(rxBytesCount / 1000) % 10 + '0';
    statusLine[pos++]=(rxBytesCount / 100) % 10 + '0';
    statusLine[pos++]=(rxBytesCount / 10) % 10 + '0';
    statusLine[pos++]=(rxBytesCount / 1) % 10 + '0';
    pos++; // 'B'

    pos++;

    statusLine[pos++]=(errors / 10) % 10 + '0';
    statusLine[pos++]=(errors / 1) % 10 + '0';
    pos++; // 'X'

    pos++;

    pos++; // 'H' like time from Horodate

    if (displayedHorodate && displayedHorodate->isValid) {
        unsigned int horodateHour = displayedHorodate->hour;
        statusLine[pos++]=(horodateHour / 10) % 10 + '0';
        statusLine[pos++]=(horodateHour / 1) % 10 + '0';
        pos++;
        unsigned int horodateMinute = displayedHorodate->minute;
        statusLine[pos++]=(horodateMinute / 10) % 10 + '0';
        statusLine[pos++]=(horodateMinute / 1) % 10 + '0';
        pos++;
        unsigned int horodateSecond = displayedHorodate->second;
        statusLine[pos++]=(horodateSecond / 10) % 10 + '0';
        statusLine[pos++]=(horodateSecond / 1) % 10 + '0';
    }
    else {
        pos += 8;
    }

    statusLine[pos] = '\0'; /* Terminate string */
    return statusLine;
}

/**
 * @brief  Main program
 */
int main(void) {
    /* STM32Fxxx HAL library initialization */
#ifdef USE_STM32F769I_DISCO
    /* Configure the MPU attributes */
    MPU_Config();

    /* Enable the CPU Cache */
    CPU_CACHE_Enable();
#endif

    HAL_Init();
  
    /* Configure the system clock to 180 MHz */
    SystemClock_Config();

    /* Configure the 4 available LEDs on USE_STM32469I_DISCOVERY */
#ifdef USE_STM32469I_DISCOVERY
    BSP_LED_Init(LED_GREEN);
    BSP_LED_Init(LED_RED);
    BSP_LED_Init(LED_ORANGE);
    BSP_LED_Init(LED_BLUE);
#endif
    /* Configure the 2 available LEDs on STM32F769I DISCOVERY */
#ifdef USE_STM32F769I_DISCO
    BSP_LED_Init(LED_RED);
    BSP_LED_Init(LED_GREEN);
#endif
    BSP_LED_On(LED_STARTUP_BLINK);
    waitDelay(250);
    BSP_LED_Off(LED_STARTUP_BLINK);

#ifdef USE_STM32F769I_DISCO
    /* Configure the Tamper push-button in GPIO Mode */
    BSP_PB_Init(BUTTON_WAKEUP, BUTTON_MODE_GPIO);
#endif

    /* Initialize the SDRAM */
    BSP_SDRAM_Init();
    //BSP_SD_Init();

    Stm32DebugOutput::get().start();
    Stm32DebugOutput::get().send("Init\n");

    Stm32SerialDriver& ticSerial = Stm32SerialDriver::get();

    //ticSerial.start(9600); /* For standard TIC */
    ticSerial.start(1200); /* For historical TIC */

    Stm32LcdDriver& lcd = Stm32LcdDriver::get();

    //BSP_TS_Init(800,480);
    /* Initialize the LCD */
    OnError_Handler(!lcd.start());

